LEXICON: dict[str, str] = {
    "back_to_categories": "⏪ Вернуться к списку категорий",
    "edit_name": "Изменить название ✏️",
    "category_info": "Выбрана категория *{name}*",
    "show_category_tasks": "Задачи из категории 📋",
    "choose_category_color": "Выберите цвет категории 🎨",
    "successful_created": "Категория *{name}* успешно создана! ✅",
    "get_new_name": "Введите новое название для категории *{name}*:",
    "successful_updated": "Название успешно изменено! ✅\nВыбрана категория *{name}*",
    "delete_category":  "Удалить категорию ❌",
    "delete_category_confirmation": "❓ Вы действительно хотите удалить данную категорию ❓",
    "cancel_delete": "Операция удаления отменена! ✅",
    "category_deleted": "Категория успешно удалена! ✅",
}

LEXICON_COMMANDS: dict = {
    "/categories": "Ваш список категорий 📋\nСтраница {page} / {pages}",
    "/create_category": "Введите название категории:"
}
