LEXICON: dict[str, str] = {
    "back_to_categories": "⏪ Вернуться к списку категорий",
    "edit_name": "Изменить название ✏️",
    "category_info": "Выбрана категория *{name}*",
    "show_category_tasks": "Задачи из категории 📋",
    "choose_category_color": "Выберите цвет категории 🎨",
    "successful_created": "Категория *{name}* успешно создана! ✅",
    "get_new_name": "Введите новое название для категории *{name}*:",
    "successful_updated": "Название успешно изменено!\n\nВыбрана категория *{name}*"
}

LEXICON_COMMANDS: dict = {
    "/categories": "Ваш список категорий 📋",
    "/create_category": "Введите название категории:"
}
